In [29]:
import pandas as pd

# Desafio 1

In [30]:
df = pd.read_csv('https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv')

In [31]:
df.isnull().sum()
df.dropna(inplace=True)

In [32]:
alunos_a_remover = df.query('Nome == "Alice" | Nome == "Carlos"').index
df.drop(index=alunos_a_remover, inplace=True)

In [33]:
selecao_aprovados = df.Aprovado == True
df = df[selecao_aprovados]

In [34]:
df.to_csv('alunos_aprovados.csv', index=False)

In [35]:
df.replace(to_replace=7.0, value=8.0, inplace=True)

In [36]:
df.to_csv('alunos_aprovados.csv', index=False)

In [37]:
df.head(50)

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    8.0      True
17      Nadia     34    8.0      True

# Desafio 2

In [38]:
df2 = pd.read_csv('https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv')
df2.fillna(0, inplace=True)

In [39]:
df2 = df2.assign(Pontos_extras = 0.4 * df2.Notas)

In [40]:
df2.head()

    Nome  Idade  Notas  Aprovado  Pontos_extras
0    Ary     20    7.5      True            3.0
1    Ana     18    0.0     False            0.0
2  Cátia     27    2.5     False            1.0
3  Denis     18    5.0     False            2.0
4   Beto     21   10.0      True            4.0

In [41]:
df2['Notas_finais'] = df2['Notas'] + df2['Pontos_extras']

In [42]:
df2.head()

    Nome  Idade  Notas  Aprovado  Pontos_extras  Notas_finais
0    Ary     20    7.5      True            3.0          10.5
1    Ana     18    0.0     False            0.0           0.0
2  Cátia     27    2.5     False            1.0           3.5
3  Denis     18    5.0     False            2.0           7.0
4   Beto     21   10.0      True            4.0          14.0

In [43]:
df2.Notas_finais = df2.Notas_finais.apply(lambda x: x if x < 10 else 10)

In [45]:
df2.head()

    Nome  Idade  Notas  Aprovado  Pontos_extras  Notas_finais
0    Ary     20    7.5      True            3.0          10.0
1    Ana     18    0.0     False            0.0           0.0
2  Cátia     27    2.5     False            1.0           3.5
3  Denis     18    5.0     False            2.0           7.0
4   Beto     21   10.0      True            4.0          10.0

In [46]:
df2['Aprovado_final'] = df2.Notas_finais.apply(lambda x: True if x >= 6 else False)

In [49]:
df2.head()

    Nome  Idade  Notas  Aprovado  Pontos_extras  Notas_finais  Aprovado_final
0    Ary     20    7.5      True            3.0          10.0            True
1    Ana     18    0.0     False            0.0           0.0           False
2  Cátia     27    2.5     False            1.0           3.5           False
3  Denis     18    5.0     False            2.0           7.0            True
4   Beto     21   10.0      True            4.0          10.0            True

In [51]:
df2.query('not Aprovado and Aprovado_final').head(20)

     Nome  Idade  Notas  Aprovado  Pontos_extras  Notas_finais  Aprovado_final
3   Denis     18    5.0     False           2.00          7.00            True
8   Alice     35    5.6     False           2.24          7.84            True
11   Igor     24    4.5     False           1.80          6.30            True